000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO-WORLD.
000300       DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 NUMERO-1 PIC 9(3) VALUE 005.
000600 01 NUMERO-2 PIC 9(3) VALUE 003.
000700 01 RESULTADO PIC 9(4).
000800 PROCEDURE DIVISION.
000900   DISPLAY 'Hello, World!'.
001000   DISPLAY 'Somar 5 + 3= '.
001100   COMPUTE RESULTADO = NUMERO-1 + NUMERO-2.
001200   DISPLAY 'A SOMA É ' RESULTADO.
001300
001400   display "Digite um número: ".
001500   accept NUMERO-1.
001600   display "Digite outro número: ".
001700   accept NUMERO-2.
001800   COMPUTE RESULTADO = NUMERO-1 + NUMERO-2.
001900   DISPLAY 'A SOMA É ' RESULTADO.
      
002000 STOP RUN.
